{
    "data": [
        {
            "title": "Data Engineer",
            "company": "@ Dynamic Sustainability Lab",
            "tasks": "Designed and implemented innovative data solutions to support sustainability and climate-smart initiatives, including a national web portal for USDA and predictive analytics tools for Syracuse University's sustainability goals. \nBuilt robust ETL pipelines, interactive BI dashboards, time series forecasting(regression) models, and a dynamic RAG chatbot to drive data accessibility, optimize decision-making, and streamline energy usage analysis. ",
            "tags": ["Data Warehousing & Analytics", "Business Intelligence", "Geographical Information Systems", "Generative AI", "Frontend Development" ],
            "year": "2024"
        },
        {
            "title": "Associate Software Developer",
            "company": "@ Protegrity",
            "tasks": "Contributed to 3 different products and led a team of 5 cross-functional (QA, DevOps, Performance) engineers to integrate in-house security products with partner solutions, driving strategic alignment and growth of the company.\nDeveloped and optimized secure, scalable data pipelines, APIs, and cloud-based solutions to support data governance, privacy, and compliance in AWS, Azure, Databricks and Cloudera.",
            "tags": [ "Big Data","Information Security", "Data Governance & Compliance","Public Cloud Infrastructure", "Backend Development","CI/CD"],
            "year": "2022"
        },
        {
            "title": "Vice President",
            "company": "@ Indian Society of Technical Education",
            "tasks": "Led a multidisciplinary technical committee of 120+ students, overseeing cross-functional initiatives and managing large-scale events, including 15+ technical workshops and 3 technical festivals, catering to 1,500+ students.\nPreviously held positions were Chief Technical Officer (CTO) and Co-Technology Lead.",
            "tags": [""],
            "year": "2020"
        }
    ]
}